## Plan Result (account-data-deleter-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807465380)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 4 to change, 2 to destroy.</code></pre>

* Update
  * aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35
  * aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07
  * aws_sqs_queue_policy.list-events-sns-subscription_sns-dlq-policy_4905D91A
  * aws_sqs_queue_policy.list-events-sns-subscription_sns-sqs-policy_593FA96C
* Replace
  * aws_sns_topic_subscription.event-consumer_user-events-sns-subscription_164DD4AB
  * aws_sns_topic_subscription.list-events-sns-subscription_D086E37D



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.event-consumer_user-events-sns-subscription_164DD4AB must be replaced
-/+ resource "aws_sns_topic_subscription" "event-consumer_user-events-sns-subscription_164DD4AB" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:0596861b-c5e2-4e1b-9e9c-9b307942df34" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:0596861b-c5e2-4e1b-9e9c-9b307942df34" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.list-events-sns-subscription_D086E37D must be replaced
-/+ resource "aws_sns_topic_subscription" "list-events-sns-subscription_D086E37D" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic:0b500163-ea58-4cc3-99ff-2d51876e0693" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic:0b500163-ea58-4cc3-99ff-2d51876e0693" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents" # forces replacement
        # (11 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.list-events-sns-subscription_sns-dlq-policy_4905D91A will be updated in-place
  ~ resource "aws_sqs_queue_policy" "list-events-sns-subscription_sns-dlq-policy_4905D91A" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Export-SNS-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.list-events-sns-subscription_sns-sqs-policy_593FA96C will be updated in-place
  ~ resource "aws_sqs_queue_policy" "list-events-sns-subscription_sns-sqs-policy_593FA96C" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Export"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"30995768cfe3eb840fc69e2735e0ffbba670a40e","Target":"account-data-deleter-cdk-production","Vars":{},"WorkflowName":"Account Data Deleter"} -->